<script>
export default {
    data() {
        return {
            显示弹窗: false,
            地图: '',
            玩家: {
                名字: "",
                位置: "",
                国家: "",
                小队: "",
                颜色: "",
            },
            电脑: [

            ],
            设置: {
                快速游戏: true,
                工具箱: true,
                拖动基地: true,
                超级武器: true,
                初始基地: true,
                摧毁桥梁: true,
                加速建造: true,
                特殊工程师: false,
                盟友基地旁边建造: true,
                允许结盟: true,
            },
            选项配置: [
                { 名字: "游戏速度", 标识: "", 配置值: "5", 配置项: [1, 2, 3, 4, 5, 6] },
                { 名字: "初始金钱", 标识: "", 配置值: "30000", 配置项: [5000, 10000, 30000, 50000, 100000, 100000000] },
                { 名字: "初始部队", 标识: "", 配置值: "", 配置项: [0, 1, 5, 10, 50, 100] },
                { 名字: "游戏版本", 标识: "", 配置值: "尤里的复仇", 配置项: ['原版', '共和国之辉', "尤里的复仇", "ares"] },
            ]
        }
    },
    created() {
        消息隧道.事件服务(this);
    },
    methods: {
        显示测试运行对话框() {
            this.显示弹窗 = true;
        },
    }
}

</script>

<template>
    <el-dialog v-model="显示弹窗" title="测试运行设置" width="800" height="500" stripe draggable>
    </el-dialog>
</template>

<style scoped></style>